Revit 2024 API
gbXMLServiceType Enumeration
 This enumeration corresponds to the systemType attribute in gbXML and is used for specifying the service for the building or space.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public enum gbXMLServiceType
Visual Basic
Public Enumeration gbXMLServiceType
Visual C++
public enum class gbXMLServiceType
Members
Member name | Description
NoServiceType
CentralHeatingRadiators
CentralHeatingConvectors
CentralHeatingRadiantFloor
CentralHeatingHotAir
OtherRoomHeater
RadiantHeaterFlue
RadiantHeaterNoFlue
RadiantHeaterMultiburner
ForcedConvectionHeaterFlue
ForcedConvectionHeaterNoFlue
VAVSingleDuct
VAVDualDuct
VAVIndoorPackagedCabinet
VAVTerminalReheat
FanCoilSystem
InductionSystem
ConstantVolumeFixedOA
ConstantVolumeVariableOA
ConstantVolumeTerminalReheat
MultizoneHotDeckColdDeck
ConstantVolumeDualDuct
RadiantCooledCeilings
ActiveChilledBeams
WaterLoopHeatPump
VariableRefrigerantFlow
SplitSystemsWithNaturalVentilation
SplitSystemsWithMechanicalVentilation
SplitSystemsWithMechanicalVentilationWithCooling
NoOfServiceTypes
See Also
Autodesk.Revit.DB.Analysis Namespace